Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_tnr.h
#ifndef _ISP_REG_TNR_H_INC_
#define _ISP_REG_TNR_H_INC_

#include <isp_reg.h>
#include <isp_reg_base.h>

#define TNR_CTRL (TNR_REG_BASE + 0x0000)
#define TNR_CLK_CTRL (TNR_REG_BASE + 0x0008)
#define TNR_TOTAL_GAIN (TNR_REG_BASE + 0x000C)
#define TNR_TNR_MAX (TNR_REG_BASE + 0x0010)
#define TNR_3DNR_MAX (TNR_REG_BASE + 0x0014)
#define TNR_FEATURE_Y_RATIO (TNR_REG_BASE + 0x0018)
#define TNR_CMPDIFF_LP_TH0 (TNR_REG_BASE + 0x001C)
#define TNR_CMPDIFF_LP_TH1 (TNR_REG_BASE + 0x0020)
#define TNR_CMPDIFF_HP_TH0 (TNR_REG_BASE + 0x0024)
#define TNR_CMPDIFF_HP_TH1 (TNR_REG_BASE + 0x0028)
#define TNR_WEIGHT_SLOPE_LP (TNR_REG_BASE + 0x002C)
#define TNR_WEIGHT_SLOPE_HP (TNR_REG_BASE + 0x0030)
#define TNR_CMPDIFF_LP_TH1_1KMIN (TNR_REG_BASE + 0x0034)
#define TNR_CMPDIFF_HP_TH1_1KMIN (TNR_REG_BASE + 0x0038)
#define TNR_CMPDIFF_LP_THOFFSET_MAX (TNR_REG_BASE + 0x003C)
#define TNR_CMPDIFF_HP_THOFFSET_MAX (TNR_REG_BASE + 0x0040)
#define TNR_DETAILS_ALPHA_MAX (TNR_REG_BASE + 0x0044)
#define TNR_DETAILS_ALPHA_MIN (TNR_REG_BASE + 0x0048)
#define TNR_RATIO2BASE_VAL_0 (TNR_REG_BASE + 0x004C)
#define TNR_RATIO2BASE_VAL_1 (TNR_REG_BASE + 0x0050)
#define TNR_RATIO2BASE_VAL_2 (TNR_REG_BASE + 0x0054)
#define TNR_RATIO2BASE_VAL_3 (TNR_REG_BASE + 0x0058)
#define TNR_RATIO2BASE_VAL_4 (TNR_REG_BASE + 0x005C)
#define TNR_RATIO2BASE_VAL_5 (TNR_REG_BASE + 0x0060)
#define TNR_RATIO2BASE_VAL_6 (TNR_REG_BASE + 0x0064)
#define TNR_RATIO2BASE_VAL_7 (TNR_REG_BASE + 0x0068)
#define TNR_RATIO2BASE_VAL_8 (TNR_REG_BASE + 0x006C)
#define TNR_INT_EN (TNR_REG_BASE + 0x0070)
#define TNR_INT_FLAG0 (TNR_REG_BASE + 0x0074)
#define TNR_QTEQ_PTS_0 (TNR_REG_BASE + 0x0080)
#define TNR_QTEQ_PTS_1 (TNR_REG_BASE + 0x0084)
#define TNR_QTEQ_PTS_2 (TNR_REG_BASE + 0x0088)
#define TNR_QTEQ_PTS_3 (TNR_REG_BASE + 0x008C)
#define TNR_QTEQ_PTS_4 (TNR_REG_BASE + 0x0090)
#define TNR_QTEQ_PTS_5 (TNR_REG_BASE + 0x0094)
#define TNR_QTEQ_PTS_6 (TNR_REG_BASE + 0x0098)
#define TNR_QTEQ_PTS_7 (TNR_REG_BASE + 0x009C)
#define TNR_QTEQ_PTS_8 (TNR_REG_BASE + 0x00A0)
#define TNR_QTEQ_PTS_9 (TNR_REG_BASE + 0x00A4)
#define TNR_QTEQ_PTS_10 (TNR_REG_BASE + 0x00A8)
#define TNR_QTEQ_PTS_11 (TNR_REG_BASE + 0x00AC)
#define TNR_QTEQ_PTS_12 (TNR_REG_BASE + 0x00B0)
#define TNR_QTEQ_PTS_13 (TNR_REG_BASE + 0x00B4)
#define TNR_QTEQ_PTS_14 (TNR_REG_BASE + 0x00B8)
#define TNR_QTEQ_PTS_15 (TNR_REG_BASE + 0x00BC)
#define TNR_QTEQ_PTS_16 (TNR_REG_BASE + 0x00C0)
#define TNR_QTEQ_PTS_17 (TNR_REG_BASE + 0x00C4)
#define TNR_QTEQ_PTS_18 (TNR_REG_BASE + 0x00C8)
#define TNR_QTEQ_PTS_19 (TNR_REG_BASE + 0x00CC)
#define TNR_QTEQ_PTS_20 (TNR_REG_BASE + 0x00D0)
#define TNR_QTEQ_PTS_21 (TNR_REG_BASE + 0x00D4)
#define TNR_QTEQ_PTS_22 (TNR_REG_BASE + 0x00D8)
#define TNR_QTEQ_PTS_23 (TNR_REG_BASE + 0x00DC)
#define TNR_QTEQ_PTS_24 (TNR_REG_BASE + 0x00E0)
#define TNR_QTEQ_PTS_25 (TNR_REG_BASE + 0x00E4)
#define TNR_QTEQ_PTS_26 (TNR_REG_BASE + 0x00E8)
#define TNR_QTEQ_PTS_27 (TNR_REG_BASE + 0x00EC)
#define TNR_QTEQ_VAL_0 (TNR_REG_BASE + 0x0100)
#define TNR_QTEQ_VAL_1 (TNR_REG_BASE + 0x0104)
#define TNR_QTEQ_VAL_2 (TNR_REG_BASE + 0x0108)
#define TNR_QTEQ_VAL_3 (TNR_REG_BASE + 0x010C)
#define TNR_QTEQ_VAL_4 (TNR_REG_BASE + 0x0110)
#define TNR_QTEQ_VAL_5 (TNR_REG_BASE + 0x0114)
#define TNR_QTEQ_VAL_6 (TNR_REG_BASE + 0x0118)
#define TNR_QTEQ_VAL_7 (TNR_REG_BASE + 0x011C)
#define TNR_QTEQ_VAL_8 (TNR_REG_BASE + 0x0120)
#define TNR_QTEQ_VAL_9 (TNR_REG_BASE + 0x0124)
#define TNR_QTEQ_VAL_10 (TNR_REG_BASE + 0x0128)
#define TNR_QTEQ_VAL_11 (TNR_REG_BASE + 0x012C)
#define TNR_QTEQ_VAL_12 (TNR_REG_BASE + 0x0130)
#define TNR_QTEQ_VAL_13 (TNR_REG_BASE + 0x0134)
#define TNR_QTEQ_VAL_14 (TNR_REG_BASE + 0x0138)
#define TNR_QTEQ_VAL_15 (TNR_REG_BASE + 0x013C)
#define TNR_QTEQ_VAL_16 (TNR_REG_BASE + 0x0140)
#define TNR_QTEQ_VAL_17 (TNR_REG_BASE + 0x0144)
#define TNR_QTEQ_VAL_18 (TNR_REG_BASE + 0x0148)
#define TNR_QTEQ_VAL_19 (TNR_REG_BASE + 0x014C)
#define TNR_QTEQ_VAL_20 (TNR_REG_BASE + 0x0150)
#define TNR_QTEQ_VAL_21 (TNR_REG_BASE + 0x0154)
#define TNR_QTEQ_VAL_22 (TNR_REG_BASE + 0x0158)
#define TNR_QTEQ_VAL_23 (TNR_REG_BASE + 0x015C)
#define TNR_QTEQ_VAL_24 (TNR_REG_BASE + 0x0160)
#define TNR_QTEQ_VAL_25 (TNR_REG_BASE + 0x0164)
#define TNR_QTEQ_VAL_26 (TNR_REG_BASE + 0x0168)
#define TNR_QTEQ_VAL_27 (TNR_REG_BASE + 0x016C)
#define TNR_QTEQ_SLOPE_0 (TNR_REG_BASE + 0x0180)
#define TNR_QTEQ_SLOPE_1 (TNR_REG_BASE + 0x0184)
#define TNR_QTEQ_SLOPE_2 (TNR_REG_BASE + 0x0188)
#define TNR_QTEQ_SLOPE_3 (TNR_REG_BASE + 0x018C)
#define TNR_QTEQ_SLOPE_4 (TNR_REG_BASE + 0x0190)
#define TNR_QTEQ_SLOPE_5 (TNR_REG_BASE + 0x0194)
#define TNR_QTEQ_SLOPE_6 (TNR_REG_BASE + 0x0198)
#define TNR_QTEQ_SLOPE_7 (TNR_REG_BASE + 0x019C)
#define TNR_QTEQ_SLOPE_8 (TNR_REG_BASE + 0x01A0)
#define TNR_QTEQ_SLOPE_9 (TNR_REG_BASE + 0x01A4)
#define TNR_QTEQ_SLOPE_10 (TNR_REG_BASE + 0x01A8)
#define TNR_QTEQ_SLOPE_11 (TNR_REG_BASE + 0x01AC)
#define TNR_QTEQ_SLOPE_12 (TNR_REG_BASE + 0x01B0)
#define TNR_QTEQ_SLOPE_13 (TNR_REG_BASE + 0x01B4)
#define TNR_QTEQ_SLOPE_14 (TNR_REG_BASE + 0x01B8)
#define TNR_QTEQ_SLOPE_15 (TNR_REG_BASE + 0x01BC)
#define TNR_QTEQ_SLOPE_16 (TNR_REG_BASE + 0x01C0)
#define TNR_QTEQ_SLOPE_17 (TNR_REG_BASE + 0x01C4)
#define TNR_QTEQ_SLOPE_18 (TNR_REG_BASE + 0x01C8)
#define TNR_QTEQ_SLOPE_19 (TNR_REG_BASE + 0x01CC)
#define TNR_QTEQ_SLOPE_20 (TNR_REG_BASE + 0x01D0)
#define TNR_QTEQ_SLOPE_21 (TNR_REG_BASE + 0x01D4)
#define TNR_QTEQ_SLOPE_22 (TNR_REG_BASE + 0x01D8)
#define TNR_QTEQ_SLOPE_23 (TNR_REG_BASE + 0x01DC)
#define TNR_QTEQ_SLOPE_24 (TNR_REG_BASE + 0x01E0)
#define TNR_QTEQ_SLOPE_25 (TNR_REG_BASE + 0x01E4)
#define TNR_QTEQ_SLOPE_26 (TNR_REG_BASE + 0x01E8)
#define TNR_QTEQ_SLOPE_27 (TNR_REG_BASE + 0x01EC)
#define TNR_SCENCE_CHANGE_DIFF_LP_G_TH0 (TNR_REG_BASE + 0x0200)
#define TNR_SCENCE_CHANGE_DIFF_LP_G_TH1 (TNR_REG_BASE + 0x0204)
#define TNR_SCENCE_CHANGE_DIFF_LP_G_M (TNR_REG_BASE + 0x0208)
#define TNR_SCENCE_CHANGE_DIFF_LP_RB_TH0 (TNR_REG_BASE + 0x020C)
#define TNR_SCENCE_CHANGE_DIFF_LP_RB_TH1 (TNR_REG_BASE + 0x0210)
#define TNR_SCENCE_CHANGE_DIFF_LP_RB_M (TNR_REG_BASE + 0x0214)
#define TNR_SCENCE_CHANGE_DIFF_LP_Y_TH0 (TNR_REG_BASE + 0x0218)
#define TNR_SCENCE_CHANGE_DIFF_LP_Y_TH1 (TNR_REG_BASE + 0x021C)
#define TNR_SCENCE_CHANGE_DIFF_LP_Y_M (TNR_REG_BASE + 0x0220)
#define TNR_SCENCE_CHANGE_DIFF_HP_G_TH0 (TNR_REG_BASE + 0x0224)
#define TNR_SCENCE_CHANGE_DIFF_HP_G_TH1 (TNR_REG_BASE + 0x0228)
#define TNR_SCENCE_CHANGE_DIFF_HP_G_M (TNR_REG_BASE + 0x022C)
#define TNR_SCENCE_DETAILS_TH0 (TNR_REG_BASE + 0x0230)
#define TNR_SCENCE_DETAILS_TH1 (TNR_REG_BASE + 0x0234)
#define TNR_SCENCE_DETAILS_TH2 (TNR_REG_BASE + 0x0238)
#define TNR_SCENCE_DETAILS_TH3 (TNR_REG_BASE + 0x023C)
#define TNR_SCENCE_DETAILS_Y0 (TNR_REG_BASE + 0x0240)
#define TNR_SCENCE_DETAILS_Y1 (TNR_REG_BASE + 0x0244)
#define TNR_SCENCE_DETAILS_Y2 (TNR_REG_BASE + 0x0248)
#define TNR_SCENCE_DETAILS_Y3 (TNR_REG_BASE + 0x024C)
#define TNR_SCENCE_DETAILS_M01 (TNR_REG_BASE + 0x0250)
#define TNR_SCENCE_DETAILS_M12 (TNR_REG_BASE + 0x0254)
#define TNR_SCENCE_DETAILS_M23 (TNR_REG_BASE + 0x0258)
#define TNR_GE_LPCOMP_COEF0 (TNR_REG_BASE + 0x034C)
#define TNR_GE_LPCOMP_COEF1 (TNR_REG_BASE + 0x0350)
#define TNR_GE_LPCOMP_COEF2 (TNR_REG_BASE + 0x0354)
#define TNR_GE_LPCOMP_COEF3 (TNR_REG_BASE + 0x0358)
#define TNR_GE_LPCOMP_COEF4 (TNR_REG_BASE + 0x035C)
#define TNR_GE_LPCOMP_COEF5 (TNR_REG_BASE + 0x0360)
#define TNR_GE_LPCOMP_ESTD_COEF0 (TNR_REG_BASE + 0x0364)
#define TNR_GE_LPCOMP_ESTD_COEF1 (TNR_REG_BASE + 0x0368)
#define TNR_GE_LPCOMP_ESTD_COEF2 (TNR_REG_BASE + 0x036C)
#define TNR_GE_SGLCOMP_COEF0 (TNR_REG_BASE + 0x0370)
#define TNR_GE_SGLCOMP_COEF1 (TNR_REG_BASE + 0x0374)
#define TNR_GE_SGLCOMP_COEF2 (TNR_REG_BASE + 0x0378)
#define TNR_GE_SGLCOMP_COEF3 (TNR_REG_BASE + 0x037C)
#define TNR_GE_SGLCOMP_COEF4 (TNR_REG_BASE + 0x0380)
#define TNR_GE_SGLCOMP_COEF5 (TNR_REG_BASE + 0x0384)
#define TNR_GE_SGLCOMP_ESTD_COEF0 (TNR_REG_BASE + 0x0388)
#define TNR_GE_SGLCOMP_ESTD_COEF1 (TNR_REG_BASE + 0x038C)
#define TNR_GE_SGLCOMP_ESTD_COEF2 (TNR_REG_BASE + 0x0390)
#define TNR_GE_EDGE_DETECTION_TH0 (TNR_REG_BASE + 0x0394)
#define TNR_GE_EDGE_DETECTION_TH1 (TNR_REG_BASE + 0x0398)
#define TNR_GE_EDGE_DETECTION_M (TNR_REG_BASE + 0x039C)
#define TNR_GE_COMPENSATE_TH (TNR_REG_BASE + 0x03A0)
#define TNR_GE_MEDIANDIFF_TH (TNR_REG_BASE + 0x03A4)
#define TNR_GE_MOIRE_TH (TNR_REG_BASE + 0x03A8)
#define TNR_GE_MOIRECOUNT_TH (TNR_REG_BASE + 0x03AC)
#define TNR_GE_THINEDGE_TH (TNR_REG_BASE + 0x03B0)
#define TNR_GE_THINEDGECOUNT_TH (TNR_REG_BASE + 0x03B4)
#define TNR_GE_COMPVAL_STRENGTH (TNR_REG_BASE + 0x03B8)
#define TNR_STREAM_EN (TNR_REG_BASE + 0x03C0)
#define TNR_STREAM_RST (TNR_REG_BASE + 0x03C4)
#define TNR_STREAM_CTRL (TNR_REG_BASE + 0x03C8)
#define TNR_STREAM_FRAME_ADDR (TNR_REG_BASE + 0x03CC)
#define TNR_STREAM_BUF_CFG (TNR_REG_BASE + 0x03D0)
#define TNR_STREAM_DDR_LEN (TNR_REG_BASE + 0x03D4)
#define TNR_STREAM_INDEX_OFFSET (TNR_REG_BASE + 0x03D8)
#define TNR_GE_CTRL (TNR_REG_BASE + 0x03E0)
#define TNR_GE_LOC_D0 (TNR_REG_BASE + 0x03E4)
#define TNR_GE_LOC_D1 (TNR_REG_BASE + 0x03E8)
#define TNR_GE_LOC_TH (TNR_REG_BASE + 0x03EC)
#define TNR_GE_LOC_RATE (TNR_REG_BASE + 0x03F0)
#define TNR_DEBUG_MODE (TNR_REG_BASE + 0x03F4)
#define TNR_INTERVAL_MAX (TNR_REG_BASE + 0x03F8)
#define TNR_COMPR_CTRL (TNR_REG_BASE + 0x03FC)

