Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_tnr.h
/* TNR_CTRL 0x0000 */
#define RAW3DNR_EN_OFFSET 0
#define RAW3DNR_EN_BITS 1
#define RAW3DNR_EN_MASK (((1 << 1) - 1) << 0)
#define SNR_EN_OFFSET 1
#define SNR_EN_BITS 1
#define SNR_EN_MASK (((1 << 1) - 1) << 1)
#define SNR_CTRL_EN_OFFSET 2
#define SNR_CTRL_EN_BITS 1
#define SNR_CTRL_EN_MASK (((1 << 1) - 1) << 2)
#define DETAILSFLAT_CTRL_EN_OFFSET 3
#define DETAILSFLAT_CTRL_EN_BITS 1
#define DETAILSFLAT_CTRL_EN_MASK (((1 << 1) - 1) << 3)
#define DETAILSFLAT_CTRL_EDGE_EN_OFFSET 4
#define DETAILSFLAT_CTRL_EDGE_EN_BITS 1
#define DETAILSFLAT_CTRL_EDGE_EN_MASK (((1 << 1) - 1) << 4)
#define RAW3DNR_MODE_OFFSET 5
#define RAW3DNR_MODE_BITS 2
#define RAW3DNR_MODE_MASK (((1 << 2) - 1) << 5)
/* TNR_CLK_CTRL 0x0008 */
#define CFG_RAW3DNR_CLK_FRAME_ALWAYS_ON_OFFSET 0
#define CFG_RAW3DNR_CLK_FRAME_ALWAYS_ON_BITS 1
#define CFG_RAW3DNR_CLK_FRAME_ALWAYS_ON_MASK (((1 << 1) - 1) << 0)
#define CFG_RAW3DNR_CLK_LINE_ALWAYS_ON_OFFSET 1
#define CFG_RAW3DNR_CLK_LINE_ALWAYS_ON_BITS 1
#define CFG_RAW3DNR_CLK_LINE_ALWAYS_ON_MASK (((1 << 1) - 1) << 1)
#define CFG_TPNR_REF_FS_SEL_OFFSET 2
#define CFG_TPNR_REF_FS_SEL_BITS 1
#define CFG_TPNR_REF_FS_SEL_MASK (((1 << 1) - 1) << 2)
#define CFG_TPNR_REF_UNDERFLOW_CLEAR_EN_OFFSET 3
#define CFG_TPNR_REF_UNDERFLOW_CLEAR_EN_BITS 1
#define CFG_TPNR_REF_UNDERFLOW_CLEAR_EN_MASK (((1 << 1) - 1) << 3)
#define CFG_TPNR_UNDERFLOW_FRAME_START_EN_OFFSET 4
#define CFG_TPNR_UNDERFLOW_FRAME_START_EN_BITS 1
#define CFG_TPNR_UNDERFLOW_FRAME_START_EN_MASK (((1 << 1) - 1) << 4)
#define CFG_TPNR_FRAME_END_CLEAR_EN_OFFSET 5
#define CFG_TPNR_FRAME_END_CLEAR_EN_BITS 1
#define CFG_TPNR_FRAME_END_CLEAR_EN_MASK (((1 << 1) - 1) << 5)
/* TNR_TOTAL_GAIN 0x000C */
#define TOTAL_GAIN_OFFSET 0
#define TOTAL_GAIN_BITS 10
#define TOTAL_GAIN_MASK (((1 << 10) - 1) << 0)
/* TNR_TNR_MAX 0x0010 */
#define TNR_ALPHA_MAX_OFFSET 0
#define TNR_ALPHA_MAX_BITS 9
#define TNR_ALPHA_MAX_MASK (((1 << 9) - 1) << 0)
/* TNR_3DNR_MAX 0x0014 */
#define D3NR_ALPHA_MAX_OFFSET 0
#define D3NR_ALPHA_MAX_BITS 9
#define D3NR_ALPHA_MAX_MASK (((1 << 9) - 1) << 0)
/* TNR_FEATURE_Y_RATIO 0x0018 */
#define Y_RATIO_B_OFFSET 0
#define Y_RATIO_B_BITS 5
#define Y_RATIO_B_MASK (((1 << 5) - 1) << 0)
#define Y_RATIO_R_OFFSET 5
#define Y_RATIO_R_BITS 5
#define Y_RATIO_R_MASK (((1 << 5) - 1) << 5)
#define Y_RATIO_G_OFFSET 10
#define Y_RATIO_G_BITS 5
#define Y_RATIO_G_MASK (((1 << 5) - 1) << 10)
/* TNR_CMPDIFF_LP_TH0 0x001C */
#define CMPDIFF_LP_TH0_OFFSET 0
#define CMPDIFF_LP_TH0_BITS 9
#define CMPDIFF_LP_TH0_MASK (((1 << 9) - 1) << 0)
/* TNR_CMPDIFF_LP_TH1 0x0020 */
#define CMPDIFF_LP_TH1_OFFSET 0
#define CMPDIFF_LP_TH1_BITS 9
#define CMPDIFF_LP_TH1_MASK (((1 << 9) - 1) << 0)
/* TNR_CMPDIFF_HP_TH0 0x0024 */
#define CMPDIFF_HP_TH0_OFFSET 0
#define CMPDIFF_HP_TH0_BITS 9
#define CMPDIFF_HP_TH0_MASK (((1 << 9) - 1) << 0)
/* TNR_CMPDIFF_HP_TH1 0x0028 */
#define CMPDIFF_HP_TH1_OFFSET 0
#define CMPDIFF_HP_TH1_BITS 9
#define CMPDIFF_HP_TH1_MASK (((1 << 9) - 1) << 0)
/* TNR_WEIGHT_SLOPE_LP 0x002C */
#define W_SLOPE_LP_OFFSET 0
#define W_SLOPE_LP_BITS 13
#define W_SLOPE_LP_MASK (((1 << 13) - 1) << 0)
/* TNR_WEIGHT_SLOPE_HP 0x0030 */
#define W_SLOPE_HP_OFFSET 0
#define W_SLOPE_HP_BITS 13
#define W_SLOPE_HP_MASK (((1 << 13) - 1) << 0)
/* TNR_CMPDIFF_LP_TH1_1KMIN 0x0034 */
#define CMPDIFF_LP_TH1_1KMIN_OFFSET 0
#define CMPDIFF_LP_TH1_1KMIN_BITS 9
#define CMPDIFF_LP_TH1_1KMIN_MASK (((1 << 9) - 1) << 0)
/* TNR_CMPDIFF_HP_TH1_1KMIN 0x0038 */
#define CMPDIFF_HP_TH1_1KMIN_OFFSET 0
#define CMPDIFF_HP_TH1_1KMIN_BITS 9
#define CMPDIFF_HP_TH1_1KMIN_MASK (((1 << 9) - 1) << 0)
/* TNR_CMPDIFF_LP_THOFFSET_MAX 0x003C */
#define CMPDIFF_LP_THOFFSET_MAX_OFFSET 0
#define CMPDIFF_LP_THOFFSET_MAX_BITS 9
#define CMPDIFF_LP_THOFFSET_MAX_MASK (((1 << 9) - 1) << 0)
/* TNR_CMPDIFF_HP_THOFFSET_MAX 0x0040 */
#define CMPDIFF_HP_THOFFSET_MAX_OFFSET 0
#define CMPDIFF_HP_THOFFSET_MAX_BITS 9
#define CMPDIFF_HP_THOFFSET_MAX_MASK (((1 << 9) - 1) << 0)
/* TNR_DETAILS_ALPHA_MAX 0x0044 */
#define DETAILS_ALPHA_MAX_OFFSET 0
#define DETAILS_ALPHA_MAX_BITS 9
#define DETAILS_ALPHA_MAX_MASK (((1 << 9) - 1) << 0)
/* TNR_DETAILS_ALPHA_MIN 0x0048 */
#define DETAILS_ALPHA_MIN_OFFSET 0
#define DETAILS_ALPHA_MIN_BITS 9
#define DETAILS_ALPHA_MIN_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_0 0x004C */
#define RATIO2BASE_VAL0_OFFSET 0
#define RATIO2BASE_VAL0_BITS 9
#define RATIO2BASE_VAL0_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_1 0x0050 */
#define RATIO2BASE_VAL1_OFFSET 0
#define RATIO2BASE_VAL1_BITS 9
#define RATIO2BASE_VAL1_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_2 0x0054 */
#define RATIO2BASE_VAL2_OFFSET 0
#define RATIO2BASE_VAL2_BITS 9
#define RATIO2BASE_VAL2_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_3 0x0058 */
#define RATIO2BASE_VAL3_OFFSET 0
#define RATIO2BASE_VAL3_BITS 9
#define RATIO2BASE_VAL3_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_4 0x005C */
#define RATIO2BASE_VAL4_OFFSET 0
#define RATIO2BASE_VAL4_BITS 9
#define RATIO2BASE_VAL4_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_5 0x0060 */
#define RATIO2BASE_VAL5_OFFSET 0
#define RATIO2BASE_VAL5_BITS 9
#define RATIO2BASE_VAL5_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_6 0x0064 */
#define RATIO2BASE_VAL6_OFFSET 0
#define RATIO2BASE_VAL6_BITS 9
#define RATIO2BASE_VAL6_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_7 0x0068 */
#define RATIO2BASE_VAL7_OFFSET 0
#define RATIO2BASE_VAL7_BITS 9
#define RATIO2BASE_VAL7_MASK (((1 << 9) - 1) << 0)
/* TNR_RATIO2BASE_VAL_8 0x006C */
#define RATIO2BASE_VAL8_OFFSET 0
#define RATIO2BASE_VAL8_BITS 9
#define RATIO2BASE_VAL8_MASK (((1 << 9) - 1) << 0)
/* TNR_INT_EN 0x0070 */
#define RAW3DNR_PRE_BUFFER_EMPTY_INT_EN_OFFSET 0
#define RAW3DNR_PRE_BUFFER_EMPTY_INT_EN_BITS 1
#define RAW3DNR_PRE_BUFFER_EMPTY_INT_EN_MASK (((1 << 1) - 1) << 0)
#define TPNR_DDR_OVERFLOW_INT_EN_OFFSET 1
#define TPNR_DDR_OVERFLOW_INT_EN_BITS 1
#define TPNR_DDR_OVERFLOW_INT_EN_MASK (((1 << 1) - 1) << 1)
#define TPNR_BUF_OVERFLOW_INT_EN_OFFSET 2
#define TPNR_BUF_OVERFLOW_INT_EN_BITS 1
#define TPNR_BUF_OVERFLOW_INT_EN_MASK (((1 << 1) - 1) << 2)
/* TNR_INT_FLAG0 0x0074 */
#define RAW3DNR_PRE_BUFFER_EMPTY_CLR_OFFSET 0
#define RAW3DNR_PRE_BUFFER_EMPTY_CLR_BITS 1
#define RAW3DNR_PRE_BUFFER_EMPTY_CLR_MASK (((1 << 1) - 1) << 0)
#define TPNR_DDR_OVERFLOW_INT_CLR_OFFSET 1
#define TPNR_DDR_OVERFLOW_INT_CLR_BITS 1
#define TPNR_DDR_OVERFLOW_INT_CLR_MASK (((1 << 1) - 1) << 1)
#define TPNR_BUF_OVERFLOW_INT_CLR_OFFSET 2
#define TPNR_BUF_OVERFLOW_INT_CLR_BITS 1
#define TPNR_BUF_OVERFLOW_INT_CLR_MASK (((1 << 1) - 1) << 2)
/* TNR_QTEQ_PTS_0 0x0080 */
#define QTEQ_PTS0_OFFSET 0
#define QTEQ_PTS0_BITS 12
#define QTEQ_PTS0_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_1 0x0084 */
#define QTEQ_PTS1_OFFSET 0
#define QTEQ_PTS1_BITS 12
#define QTEQ_PTS1_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_2 0x0088 */
#define QTEQ_PTS2_OFFSET 0
#define QTEQ_PTS2_BITS 12
#define QTEQ_PTS2_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_3 0x008C */
#define QTEQ_PTS3_OFFSET 0
#define QTEQ_PTS3_BITS 12
#define QTEQ_PTS3_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_4 0x0090 */
#define QTEQ_PTS4_OFFSET 0
#define QTEQ_PTS4_BITS 12
#define QTEQ_PTS4_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_5 0x0094 */
#define QTEQ_PTS5_OFFSET 0
#define QTEQ_PTS5_BITS 12
#define QTEQ_PTS5_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_6 0x0098 */
#define QTEQ_PTS6_OFFSET 0
#define QTEQ_PTS6_BITS 12
#define QTEQ_PTS6_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_7 0x009C */
#define QTEQ_PTS7_OFFSET 0
#define QTEQ_PTS7_BITS 12
#define QTEQ_PTS7_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_8 0x00A0 */
#define QTEQ_PTS8_OFFSET 0
#define QTEQ_PTS8_BITS 12
#define QTEQ_PTS8_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_9 0x00A4 */
#define QTEQ_PTS9_OFFSET 0
#define QTEQ_PTS9_BITS 12
#define QTEQ_PTS9_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_10 0x00A8 */
#define QTEQ_PTS10_OFFSET 0
#define QTEQ_PTS10_BITS 12
#define QTEQ_PTS10_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_11 0x00AC */
#define QTEQ_PTS11_OFFSET 0
#define QTEQ_PTS11_BITS 12
#define QTEQ_PTS11_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_12 0x00B0 */
#define QTEQ_PTS12_OFFSET 0
#define QTEQ_PTS12_BITS 12
#define QTEQ_PTS12_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_13 0x00B4 */
#define QTEQ_PTS13_OFFSET 0
#define QTEQ_PTS13_BITS 12
#define QTEQ_PTS13_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_14 0x00B8 */
#define QTEQ_PTS14_OFFSET 0
#define QTEQ_PTS14_BITS 12
#define QTEQ_PTS14_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_15 0x00BC */
#define QTEQ_PTS15_OFFSET 0
#define QTEQ_PTS15_BITS 12
#define QTEQ_PTS15_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_16 0x00C0 */
#define QTEQ_PTS16_OFFSET 0
#define QTEQ_PTS16_BITS 12
#define QTEQ_PTS16_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_17 0x00C4 */
#define QTEQ_PTS17_OFFSET 0
#define QTEQ_PTS17_BITS 12
#define QTEQ_PTS17_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_18 0x00C8 */
#define QTEQ_PTS18_OFFSET 0
#define QTEQ_PTS18_BITS 12
#define QTEQ_PTS18_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_19 0x00CC */
#define QTEQ_PTS19_OFFSET 0
#define QTEQ_PTS19_BITS 12
#define QTEQ_PTS19_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_20 0x00D0 */
#define QTEQ_PTS20_OFFSET 0
#define QTEQ_PTS20_BITS 12
#define QTEQ_PTS20_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_21 0x00D4 */
#define QTEQ_PTS21_OFFSET 0
#define QTEQ_PTS21_BITS 12
#define QTEQ_PTS21_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_22 0x00D8 */
#define QTEQ_PTS22_OFFSET 0
#define QTEQ_PTS22_BITS 12
#define QTEQ_PTS22_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_23 0x00DC */
#define QTEQ_PTS23_OFFSET 0
#define QTEQ_PTS23_BITS 12
#define QTEQ_PTS23_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_24 0x00E0 */
#define QTEQ_PTS24_OFFSET 0
#define QTEQ_PTS24_BITS 12
#define QTEQ_PTS24_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_25 0x00E4 */
#define QTEQ_PTS25_OFFSET 0
#define QTEQ_PTS25_BITS 12
#define QTEQ_PTS25_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_26 0x00E8 */
#define QTEQ_PTS26_OFFSET 0
#define QTEQ_PTS26_BITS 12
#define QTEQ_PTS26_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_PTS_27 0x00EC */
#define QTEQ_PTS27_OFFSET 0
#define QTEQ_PTS27_BITS 12
#define QTEQ_PTS27_MASK (((1 << 12) - 1) << 0)
/* TNR_QTEQ_VAL_0 0x0100 */
#define QTEQ_VAL0_OFFSET 0
#define QTEQ_VAL0_BITS 14
#define QTEQ_VAL0_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_1 0x0104 */
#define QTEQ_VAL1_OFFSET 0
#define QTEQ_VAL1_BITS 14
#define QTEQ_VAL1_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_2 0x0108 */
#define QTEQ_VAL2_OFFSET 0
#define QTEQ_VAL2_BITS 14
#define QTEQ_VAL2_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_3 0x010C */
#define QTEQ_VAL3_OFFSET 0
#define QTEQ_VAL3_BITS 14
#define QTEQ_VAL3_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_4 0x0110 */
#define QTEQ_VAL4_OFFSET 0
#define QTEQ_VAL4_BITS 14
#define QTEQ_VAL4_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_5 0x0114 */
#define QTEQ_VAL5_OFFSET 0
#define QTEQ_VAL5_BITS 14
#define QTEQ_VAL5_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_6 0x0118 */
#define QTEQ_VAL6_OFFSET 0
#define QTEQ_VAL6_BITS 14
#define QTEQ_VAL6_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_7 0x011C */
#define QTEQ_VAL7_OFFSET 0
#define QTEQ_VAL7_BITS 14
#define QTEQ_VAL7_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_8 0x0120 */
#define QTEQ_VAL8_OFFSET 0
#define QTEQ_VAL8_BITS 14
#define QTEQ_VAL8_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_9 0x0124 */
#define QTEQ_VAL9_OFFSET 0
#define QTEQ_VAL9_BITS 14
#define QTEQ_VAL9_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_10 0x0128 */
#define QTEQ_VAL10_OFFSET 0
#define QTEQ_VAL10_BITS 14
#define QTEQ_VAL10_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_11 0x012C */
#define QTEQ_VAL11_OFFSET 0
#define QTEQ_VAL11_BITS 14
#define QTEQ_VAL11_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_12 0x0130 */
#define QTEQ_VAL12_OFFSET 0
#define QTEQ_VAL12_BITS 14
#define QTEQ_VAL12_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_13 0x0134 */
#define QTEQ_VAL13_OFFSET 0
#define QTEQ_VAL13_BITS 14
#define QTEQ_VAL13_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_14 0x0138 */
#define QTEQ_VAL14_OFFSET 0
#define QTEQ_VAL14_BITS 14
#define QTEQ_VAL14_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_15 0x013C */
#define QTEQ_VAL15_OFFSET 0
#define QTEQ_VAL15_BITS 14
#define QTEQ_VAL15_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_16 0x0140 */
#define QTEQ_VAL16_OFFSET 0
#define QTEQ_VAL16_BITS 14
#define QTEQ_VAL16_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_17 0x0144 */
#define QTEQ_VAL17_OFFSET 0
#define QTEQ_VAL17_BITS 14
#define QTEQ_VAL17_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_18 0x0148 */
#define QTEQ_VAL18_OFFSET 0
#define QTEQ_VAL18_BITS 14
#define QTEQ_VAL18_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_19 0x014C */
#define QTEQ_VAL19_OFFSET 0
#define QTEQ_VAL19_BITS 14
#define QTEQ_VAL19_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_20 0x0150 */
#define QTEQ_VAL20_OFFSET 0
#define QTEQ_VAL20_BITS 14
#define QTEQ_VAL20_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_21 0x0154 */
#define QTEQ_VAL21_OFFSET 0
#define QTEQ_VAL21_BITS 14
#define QTEQ_VAL21_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_22 0x0158 */
#define QTEQ_VAL22_OFFSET 0
#define QTEQ_VAL22_BITS 14
#define QTEQ_VAL22_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_23 0x015C */
#define QTEQ_VAL23_OFFSET 0
#define QTEQ_VAL23_BITS 14
#define QTEQ_VAL23_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_24 0x0160 */
#define QTEQ_VAL24_OFFSET 0
#define QTEQ_VAL24_BITS 14
#define QTEQ_VAL24_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_25 0x0164 */
#define QTEQ_VAL25_OFFSET 0
#define QTEQ_VAL25_BITS 14
#define QTEQ_VAL25_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_26 0x0168 */
#define QTEQ_VAL26_OFFSET 0
#define QTEQ_VAL26_BITS 14
#define QTEQ_VAL26_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_VAL_27 0x016C */
#define QTEQ_VAL27_OFFSET 0
#define QTEQ_VAL27_BITS 14
#define QTEQ_VAL27_MASK (((1 << 14) - 1) << 0)
/* TNR_QTEQ_SLOPE_0 0x0180 */
#define QTEQ_SLOPE0_OFFSET 0
#define QTEQ_SLOPE0_BITS 16
#define QTEQ_SLOPE0_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_1 0x0184 */
#define QTEQ_SLOPE1_OFFSET 0
#define QTEQ_SLOPE1_BITS 16
#define QTEQ_SLOPE1_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_2 0x0188 */
#define QTEQ_SLOPE2_OFFSET 0
#define QTEQ_SLOPE2_BITS 16
#define QTEQ_SLOPE2_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_3 0x018C */
#define QTEQ_SLOPE3_OFFSET 0
#define QTEQ_SLOPE3_BITS 16
#define QTEQ_SLOPE3_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_4 0x0190 */
#define QTEQ_SLOPE4_OFFSET 0
#define QTEQ_SLOPE4_BITS 16
#define QTEQ_SLOPE4_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_5 0x0194 */
#define QTEQ_SLOPE5_OFFSET 0
#define QTEQ_SLOPE5_BITS 16
#define QTEQ_SLOPE5_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_6 0x0198 */
#define QTEQ_SLOPE6_OFFSET 0
#define QTEQ_SLOPE6_BITS 16
#define QTEQ_SLOPE6_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_7 0x019C */
#define QTEQ_SLOPE7_OFFSET 0
#define QTEQ_SLOPE7_BITS 16
#define QTEQ_SLOPE7_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_8 0x01A0 */
#define QTEQ_SLOPE8_OFFSET 0
#define QTEQ_SLOPE8_BITS 16
#define QTEQ_SLOPE8_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_9 0x01A4 */
#define QTEQ_SLOPE9_OFFSET 0
#define QTEQ_SLOPE9_BITS 16
#define QTEQ_SLOPE9_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_10 0x01A8 */
#define QTEQ_SLOPE10_OFFSET 0
#define QTEQ_SLOPE10_BITS 16
#define QTEQ_SLOPE10_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_11 0x01AC */
#define QTEQ_SLOPE11_OFFSET 0
#define QTEQ_SLOPE11_BITS 16
#define QTEQ_SLOPE11_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_12 0x01B0 */
#define QTEQ_SLOPE12_OFFSET 0
#define QTEQ_SLOPE12_BITS 16
#define QTEQ_SLOPE12_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_13 0x01B4 */
#define QTEQ_SLOPE13_OFFSET 0
#define QTEQ_SLOPE13_BITS 16
#define QTEQ_SLOPE13_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_14 0x01B8 */
#define QTEQ_SLOPE14_OFFSET 0
#define QTEQ_SLOPE14_BITS 16
#define QTEQ_SLOPE14_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_15 0x01BC */
#define QTEQ_SLOPE15_OFFSET 0
#define QTEQ_SLOPE15_BITS 16
#define QTEQ_SLOPE15_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_16 0x01C0 */
#define QTEQ_SLOPE16_OFFSET 0
#define QTEQ_SLOPE16_BITS 16
#define QTEQ_SLOPE16_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_17 0x01C4 */
#define QTEQ_SLOPE17_OFFSET 0
#define QTEQ_SLOPE17_BITS 16
#define QTEQ_SLOPE17_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_18 0x01C8 */
#define QTEQ_SLOPE18_OFFSET 0
#define QTEQ_SLOPE18_BITS 16
#define QTEQ_SLOPE18_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_19 0x01CC */
#define QTEQ_SLOPE19_OFFSET 0
#define QTEQ_SLOPE19_BITS 16
#define QTEQ_SLOPE19_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_20 0x01D0 */
#define QTEQ_SLOPE20_OFFSET 0
#define QTEQ_SLOPE20_BITS 16
#define QTEQ_SLOPE20_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_21 0x01D4 */
#define QTEQ_SLOPE21_OFFSET 0
#define QTEQ_SLOPE21_BITS 16
#define QTEQ_SLOPE21_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_22 0x01D8 */
#define QTEQ_SLOPE22_OFFSET 0
#define QTEQ_SLOPE22_BITS 16
#define QTEQ_SLOPE22_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_23 0x01DC */
#define QTEQ_SLOPE23_OFFSET 0
#define QTEQ_SLOPE23_BITS 16
#define QTEQ_SLOPE23_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_24 0x01E0 */
#define QTEQ_SLOPE24_OFFSET 0
#define QTEQ_SLOPE24_BITS 16
#define QTEQ_SLOPE24_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_25 0x01E4 */
#define QTEQ_SLOPE25_OFFSET 0
#define QTEQ_SLOPE25_BITS 16
#define QTEQ_SLOPE25_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_26 0x01E8 */
#define QTEQ_SLOPE26_OFFSET 0
#define QTEQ_SLOPE26_BITS 16
#define QTEQ_SLOPE26_MASK (((1 << 16) - 1) << 0)
/* TNR_QTEQ_SLOPE_27 0x01EC */
#define QTEQ_SLOPE27_OFFSET 0
#define QTEQ_SLOPE27_BITS 16
#define QTEQ_SLOPE27_MASK (((1 << 16) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_G_TH0 0x0200 */
#define SCNCHGDIFF_LP_G_TH0_OFFSET 0
#define SCNCHGDIFF_LP_G_TH0_BITS 15
#define SCNCHGDIFF_LP_G_TH0_MASK (((1 << 15) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_G_TH1 0x0204 */
#define SCNCHGDIFF_LP_G_TH1_OFFSET 0
#define SCNCHGDIFF_LP_G_TH1_BITS 15
#define SCNCHGDIFF_LP_G_TH1_MASK (((1 << 15) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_G_M 0x0208 */
#define SCNCHGDIFF_LP_G_M_OFFSET 0
#define SCNCHGDIFF_LP_G_M_BITS 20
#define SCNCHGDIFF_LP_G_M_MASK (((1 << 20) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_RB_TH0 0x020C */
#define SCNCHGDIFF_LP_RB_TH0_OFFSET 0
#define SCNCHGDIFF_LP_RB_TH0_BITS 15
#define SCNCHGDIFF_LP_RB_TH0_MASK (((1 << 15) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_RB_TH1 0x0210 */
#define SCNCHGDIFF_LP_RB_TH1_OFFSET 0
#define SCNCHGDIFF_LP_RB_TH1_BITS 15
#define SCNCHGDIFF_LP_RB_TH1_MASK (((1 << 15) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_RB_M 0x0214 */
#define SCNCHGDIFF_LP_RB_M_OFFSET 0
#define SCNCHGDIFF_LP_RB_M_BITS 20
#define SCNCHGDIFF_LP_RB_M_MASK (((1 << 20) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_Y_TH0 0x0218 */
#define SCNCHGDIFF_LP_Y_TH0_OFFSET 0
#define SCNCHGDIFF_LP_Y_TH0_BITS 15
#define SCNCHGDIFF_LP_Y_TH0_MASK (((1 << 15) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_Y_TH1 0x021C */
#define SCNCHGDIFF_LP_Y_TH1_OFFSET 0
#define SCNCHGDIFF_LP_Y_TH1_BITS 15
#define SCNCHGDIFF_LP_Y_TH1_MASK (((1 << 15) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_LP_Y_M 0x0220 */
#define SCNCHGDIFF_LP_Y_M_OFFSET 0
#define SCNCHGDIFF_LP_Y_M_BITS 20
#define SCNCHGDIFF_LP_Y_M_MASK (((1 << 20) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_HP_G_TH0 0x0224 */
#define SCNCHGDIFF_HP_G_TH0_OFFSET 0
#define SCNCHGDIFF_HP_G_TH0_BITS 15
#define SCNCHGDIFF_HP_G_TH0_MASK (((1 << 15) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_HP_G_TH1 0x0228 */
#define SCNCHGDIFF_HP_G_TH1_OFFSET 0
#define SCNCHGDIFF_HP_G_TH1_BITS 15
#define SCNCHGDIFF_HP_G_TH1_MASK (((1 << 15) - 1) << 0)
/* TNR_SCENCE_CHANGE_DIFF_HP_G_M 0x022C */
#define SCNCHGDIFF_HP_G_M_OFFSET 0
#define SCNCHGDIFF_HP_G_M_BITS 20
#define SCNCHGDIFF_HP_G_M_MASK (((1 << 20) - 1) << 0)
/* TNR_SCENCE_DETAILS_TH0 0x0230 */
#define SCNDETAILS_TH0_OFFSET 0
#define SCNDETAILS_TH0_BITS 11
#define SCNDETAILS_TH0_MASK (((1 << 11) - 1) << 0)
/* TNR_SCENCE_DETAILS_TH1 0x0234 */
#define SCNDETAILS_TH1_OFFSET 0
#define SCNDETAILS_TH1_BITS 11
#define SCNDETAILS_TH1_MASK (((1 << 11) - 1) << 0)
/* TNR_SCENCE_DETAILS_TH2 0x0238 */
#define SCNDETAILS_TH2_OFFSET 0
#define SCNDETAILS_TH2_BITS 11
#define SCNDETAILS_TH2_MASK (((1 << 11) - 1) << 0)
/* TNR_SCENCE_DETAILS_TH3 0x023C */
#define SCNDETAILS_TH3_OFFSET 0
#define SCNDETAILS_TH3_BITS 11
#define SCNDETAILS_TH3_MASK (((1 << 11) - 1) << 0)
/* TNR_SCENCE_DETAILS_Y0 0x0240 */
#define SCNDETAILS_Y0_OFFSET 0
#define SCNDETAILS_Y0_BITS 9
#define SCNDETAILS_Y0_MASK (((1 << 9) - 1) << 0)
/* TNR_SCENCE_DETAILS_Y1 0x0244 */
#define SCNDETAILS_Y1_OFFSET 0
#define SCNDETAILS_Y1_BITS 9
#define SCNDETAILS_Y1_MASK (((1 << 9) - 1) << 0)
/* TNR_SCENCE_DETAILS_Y2 0x0248 */
#define SCNDETAILS_Y2_OFFSET 0
#define SCNDETAILS_Y2_BITS 9
#define SCNDETAILS_Y2_MASK (((1 << 9) - 1) << 0)
/* TNR_SCENCE_DETAILS_Y3 0x024C */
#define SCNDETAILS_Y3_OFFSET 0
#define SCNDETAILS_Y3_BITS 9
#define SCNDETAILS_Y3_MASK (((1 << 9) - 1) << 0)
/* TNR_SCENCE_DETAILS_M01 0x0250 */
#define SCNDETAILS_M01_OFFSET 0
#define SCNDETAILS_M01_BITS 19
#define SCNDETAILS_M01_MASK (((1 << 19) - 1) << 0)
/* TNR_SCENCE_DETAILS_M12 0x0254 */
#define SCNDETAILS_M12_OFFSET 0
#define SCNDETAILS_M12_BITS 20
#define SCNDETAILS_M12_MASK (((1 << 20) - 1) << 0)
/* TNR_SCENCE_DETAILS_M23 0x0258 */
#define SCNDETAILS_M23_OFFSET 0
#define SCNDETAILS_M23_BITS 20
#define SCNDETAILS_M23_MASK (((1 << 20) - 1) << 0)
/* TNR_GE_LPCOMP_COEF0 0x034C */
#define COEF_GELPCOMP0_OFFSET 0
#define COEF_GELPCOMP0_BITS 10
#define COEF_GELPCOMP0_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_LPCOMP_COEF1 0x0350 */
#define COEF_GELPCOMP1_OFFSET 0
#define COEF_GELPCOMP1_BITS 10
#define COEF_GELPCOMP1_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_LPCOMP_COEF2 0x0354 */
#define COEF_GELPCOMP2_OFFSET 0
#define COEF_GELPCOMP2_BITS 10
#define COEF_GELPCOMP2_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_LPCOMP_COEF3 0x0358 */
#define COEF_GELPCOMP3_OFFSET 0
#define COEF_GELPCOMP3_BITS 10
#define COEF_GELPCOMP3_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_LPCOMP_COEF4 0x035C */
#define COEF_GELPCOMP4_OFFSET 0
#define COEF_GELPCOMP4_BITS 10
#define COEF_GELPCOMP4_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_LPCOMP_COEF5 0x0360 */
#define COEF_GELPCOMP5_OFFSET 0
#define COEF_GELPCOMP5_BITS 10
#define COEF_GELPCOMP5_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_LPCOMP_ESTD_COEF0 0x0364 */
#define COEF_GELPCOMP_ESTD0_OFFSET 0
#define COEF_GELPCOMP_ESTD0_BITS 10
#define COEF_GELPCOMP_ESTD0_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_LPCOMP_ESTD_COEF1 0x0368 */
#define COEF_GELPCOMP_ESTD1_OFFSET 0
#define COEF_GELPCOMP_ESTD1_BITS 10
#define COEF_GELPCOMP_ESTD1_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_LPCOMP_ESTD_COEF2 0x036C */
#define COEF_GELPCOMP_ESTD2_OFFSET 0
#define COEF_GELPCOMP_ESTD2_BITS 10
#define COEF_GELPCOMP_ESTD2_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_COEF0 0x0370 */
#define COEF_GESGLCOMP0_OFFSET 0
#define COEF_GESGLCOMP0_BITS 10
#define COEF_GESGLCOMP0_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_COEF1 0x0374 */
#define COEF_GESGLCOMP1_OFFSET 0
#define COEF_GESGLCOMP1_BITS 10
#define COEF_GESGLCOMP1_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_COEF2 0x0378 */
#define COEF_GESGLCOMP2_OFFSET 0
#define COEF_GESGLCOMP2_BITS 10
#define COEF_GESGLCOMP2_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_COEF3 0x037C */
#define COEF_GESGLCOMP3_OFFSET 0
#define COEF_GESGLCOMP3_BITS 10
#define COEF_GESGLCOMP3_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_COEF4 0x0380 */
#define COEF_GESGLCOMP4_OFFSET 0
#define COEF_GESGLCOMP4_BITS 10
#define COEF_GESGLCOMP4_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_COEF5 0x0384 */
#define COEF_GESGLCOMP5_OFFSET 0
#define COEF_GESGLCOMP5_BITS 10
#define COEF_GESGLCOMP5_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_ESTD_COEF0 0x0388 */
#define COEF_GESGLCOMP_ESTD0_OFFSET 0
#define COEF_GESGLCOMP_ESTD0_BITS 10
#define COEF_GESGLCOMP_ESTD0_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_ESTD_COEF1 0x038C */
#define COEF_GESGLCOMP_ESTD1_OFFSET 0
#define COEF_GESGLCOMP_ESTD1_BITS 10
#define COEF_GESGLCOMP_ESTD1_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_SGLCOMP_ESTD_COEF2 0x0390 */
