Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_tnr.h
#define COEF_GESGLCOMP_ESTD2_OFFSET 0
#define COEF_GESGLCOMP_ESTD2_BITS 10
#define COEF_GESGLCOMP_ESTD2_MASK (((1 << 10) - 1) << 0)
/* TNR_GE_EDGE_DETECTION_TH0 0x0394 */
#define GE_EDGEDETECTION_TH0_OFFSET 0
#define GE_EDGEDETECTION_TH0_BITS 11
#define GE_EDGEDETECTION_TH0_MASK (((1 << 11) - 1) << 0)
/* TNR_GE_EDGE_DETECTION_TH1 0x0398 */
#define GE_EDGEDETECTION_TH1_OFFSET 0
#define GE_EDGEDETECTION_TH1_BITS 11
#define GE_EDGEDETECTION_TH1_MASK (((1 << 11) - 1) << 0)
/* TNR_GE_EDGE_DETECTION_M 0x039C */
#define GE_EDGEDETECTION_M_OFFSET 0
#define GE_EDGEDETECTION_M_BITS 14
#define GE_EDGEDETECTION_M_MASK (((1 << 14) - 1) << 0)
/* TNR_GE_COMPENSATE_TH 0x03A0 */
#define GE_COMPVAL_TH_OFFSET 0
#define GE_COMPVAL_TH_BITS 9
#define GE_COMPVAL_TH_MASK (((1 << 9) - 1) << 0)
/* TNR_GE_MEDIANDIFF_TH 0x03A4 */
#define GE_MEDIANDIFF_TH_OFFSET 0
#define GE_MEDIANDIFF_TH_BITS 9
#define GE_MEDIANDIFF_TH_MASK (((1 << 9) - 1) << 0)
/* TNR_GE_MOIRE_TH 0x03A8 */
#define GE_MOIRE_TH_OFFSET 0
#define GE_MOIRE_TH_BITS 9
#define GE_MOIRE_TH_MASK (((1 << 9) - 1) << 0)
/* TNR_GE_MOIRECOUNT_TH 0x03AC */
#define GE_MOIRECOUNT_TH_OFFSET 0
#define GE_MOIRECOUNT_TH_BITS 4
#define GE_MOIRECOUNT_TH_MASK (((1 << 4) - 1) << 0)
/* TNR_GE_THINEDGE_TH 0x03B0 */
#define GE_THINEDGE_TH_OFFSET 0
#define GE_THINEDGE_TH_BITS 9
#define GE_THINEDGE_TH_MASK (((1 << 9) - 1) << 0)
/* TNR_GE_THINEDGECOUNT_TH 0x03B4 */
#define GE_THINEDGECOUNT_TH_OFFSET 0
#define GE_THINEDGECOUNT_TH_BITS 3
#define GE_THINEDGECOUNT_TH_MASK (((1 << 3) - 1) << 0)
/* TNR_GE_COMPVAL_STRENGTH 0x03B8 */
#define GE_COMPVAL_STRENGTH_OFFSET 0
#define GE_COMPVAL_STRENGTH_BITS 3
#define GE_COMPVAL_STRENGTH_MASK (((1 << 3) - 1) << 0)
/* TNR_STREAM_EN 0x03C0 */
#define TPNR_EN_OFFSET 0
#define TPNR_EN_BITS 1
#define TPNR_EN_MASK (((1 << 1) - 1) << 0)
/* TNR_STREAM_RST 0x03C4 */
#define TPNR_RST_OFFSET 0
#define TPNR_RST_BITS 1
#define TPNR_RST_MASK (((1 << 1) - 1) << 0)
/* TNR_STREAM_CTRL 0x03C8 */
#define BURST_LENGTH_SEL_TPNR_WR_OFFSET 0
#define BURST_LENGTH_SEL_TPNR_WR_BITS 1
#define BURST_LENGTH_SEL_TPNR_WR_MASK (((1 << 1) - 1) << 0)
#define BURST_LENGTH_SEL_TPNR_RD_OFFSET 1
#define BURST_LENGTH_SEL_TPNR_RD_BITS 1
#define BURST_LENGTH_SEL_TPNR_RD_MASK (((1 << 1) - 1) << 1)
#define DATA_REQ_EN_TPNR_OFFSET 2
#define DATA_REQ_EN_TPNR_BITS 1
#define DATA_REQ_EN_TPNR_MASK (((1 << 1) - 1) << 2)
/* TNR_STREAM_FRAME_ADDR 0x03CC */
#define FRAME_ADDR_TPNR_OFFSET 4
#define FRAME_ADDR_TPNR_BITS 28
#define FRAME_ADDR_TPNR_MASK (((1 << 28) - 1) << 4)
/* TNR_STREAM_BUF_CFG 0x03D0 */
#define BUF_START_ADDR_TPNR_OFFSET 4
#define BUF_START_ADDR_TPNR_BITS 11
#define BUF_START_ADDR_TPNR_MASK (((1 << 11) - 1) << 4)
#define BUF_SIZE_TPNR_OFFSET 20
#define BUF_SIZE_TPNR_BITS 12
#define BUF_SIZE_TPNR_MASK (((1 << 12) - 1) << 20)
/* TNR_STREAM_DDR_LEN 0x03D4 */
#define DDR_LEN_TPNR_OFFSET 4
#define DDR_LEN_TPNR_BITS 20
#define DDR_LEN_TPNR_MASK (((1 << 20) - 1) << 4)
/* TNR_STREAM_INDEX_OFFSET 0x03D8 */
#define PIX_CNT_TPNR_OFFSET 4
#define PIX_CNT_TPNR_BITS 20
#define PIX_CNT_TPNR_MASK (((1 << 20) - 1) << 4)
/* TNR_GE_CTRL 0x03E0 */
#define GRGB_EN_OFFSET 0
#define GRGB_EN_BITS 1
#define GRGB_EN_MASK (((1 << 1) - 1) << 0)
#define GE_EDGEDETECT_EN_OFFSET 1
#define GE_EDGEDETECT_EN_BITS 1
#define GE_EDGEDETECT_EN_MASK (((1 << 1) - 1) << 1)
#define GE_COMPVAL_TH_EN_OFFSET 2
#define GE_COMPVAL_TH_EN_BITS 1
#define GE_COMPVAL_TH_EN_MASK (((1 << 1) - 1) << 2)
#define GE_MEDIANDIFF_TH_EN_OFFSET 3
#define GE_MEDIANDIFF_TH_EN_BITS 1
#define GE_MEDIANDIFF_TH_EN_MASK (((1 << 1) - 1) << 3)
#define GE_MOIREMODE_EN_OFFSET 4
#define GE_MOIREMODE_EN_BITS 1
#define GE_MOIREMODE_EN_MASK (((1 << 1) - 1) << 4)
#define GE_LOC_EN_OFFSET 5
#define GE_LOC_EN_BITS 1
#define GE_LOC_EN_MASK (((1 << 1) - 1) << 5)
#define GE_CUR_ONLY_EN_OFFSET 6
#define GE_CUR_ONLY_EN_BITS 1
#define GE_CUR_ONLY_EN_MASK (((1 << 1) - 1) << 6)
/* TNR_GE_LOC_D0 0x03E4 */
#define GE_LOC_D0_OFFSET 0
#define GE_LOC_D0_BITS 12
#define GE_LOC_D0_MASK (((1 << 12) - 1) << 0)
/* TNR_GE_LOC_D1 0x03E8 */
#define GE_LOC_D1_OFFSET 0
#define GE_LOC_D1_BITS 12
#define GE_LOC_D1_MASK (((1 << 12) - 1) << 0)
/* TNR_GE_LOC_TH 0x03EC */
#define GE_LOC_TH_OFFSET 0
#define GE_LOC_TH_BITS 9
#define GE_LOC_TH_MASK (((1 << 9) - 1) << 0)
/* TNR_GE_LOC_RATE 0x03F0 */
#define GE_LOC_RATE_OFFSET 0
#define GE_LOC_RATE_BITS 21
#define GE_LOC_RATE_MASK (((1 << 21) - 1) << 0)
/* TNR_DEBUG_MODE 0x03F4 */
#define RAW3DNR_DEBUG_MODE_OFFSET 0
#define RAW3DNR_DEBUG_MODE_BITS 5
#define RAW3DNR_DEBUG_MODE_MASK (((1 << 5) - 1) << 0)
#define RAW3DNR_REF_DEBUG_OFFSET 8
#define RAW3DNR_REF_DEBUG_BITS 1
#define RAW3DNR_REF_DEBUG_MASK (((1 << 1) - 1) << 8)
/* TNR_INTERVAL_MAX 0x03F8 */
#define RAW3DNR_INTERVAL_MAX_OFFSET 0
#define RAW3DNR_INTERVAL_MAX_BITS 16
#define RAW3DNR_INTERVAL_MAX_MASK (((1 << 16) - 1) << 0)
/* TNR_COMPR_CTRL 0x03FC */
#define BUF_COMPR_EN_OFFSET 0
#define BUF_COMPR_EN_BITS 1
#define BUF_COMPR_EN_MASK (((1 << 1) - 1) << 0)
#define BUF_COMPR_MODE_OFFSET 1
#define BUF_COMPR_MODE_BITS 1
#define BUF_COMPR_MODE_MASK (((1 << 1) - 1) << 1)
#define BUF_COMPR_RAND_EN_OFFSET 2
#define BUF_COMPR_RAND_EN_BITS 1
#define BUF_COMPR_RAND_EN_MASK (((1 << 1) - 1) << 2)
#define BUF_COMPR_LFSR_MODE_OFFSET 3
#define BUF_COMPR_LFSR_MODE_BITS 1
#define BUF_COMPR_LFSR_MODE_MASK (((1 << 1) - 1) << 3)

#endif /* _ISP_REG_TNR_H_INC_ */

